app/controllers/api/v1/authentications_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "try@a.com"], ["LIMIT", 1]]
---
            def login
                user = User.find_by(email: login_params[:email])